
#Использовать logos
#Использовать gitrunner

Перем Лог;
Перем КомандыПлагина;

Перем Обработчик;

Перем URLРепозитория;
Перем ИмяВетки;
Перем ИмяЦелевойВетки;
Перем ПолучитьИзменения;
Перем ОтправитьИзменения;
Перем ОтправитьЗапросНаСлияние;

Перем КоличествоКоммитовДоPush;
Перем СчетчикКоммитов;
Перем ОтправлятьТеги;
Перем PushOptions;
Перем MergeOptions;

Перем ГитРепозиторий;

#Область Интерфейс_плагина

// Возвращает версию плагина
//
//  Возвращаемое значение:
//   Строка - текущая версия плагина
//
Функция Версия() Экспорт
	Возврат "2.0.0";
КонецФункции

// Возвращает приоритет выполнения плагина
//
//  Возвращаемое значение:
//   Число - приоритет выполнения плагина
//
Функция Приоритет() Экспорт
	Возврат 0;
КонецФункции

// Возвращает описание плагина
//
//  Возвращаемое значение:
//   Строка - описание функциональности плагина
//
Функция Описание() Экспорт
	Возврат "Плагин добавляет функциональность синхронизации с удаленным репозиторием git";
КонецФункции

// Возвращает подробную справку к плагину 
//
//  Возвращаемое значение:
//   Строка - подробная справка для плагина
//
Функция Справка() Экспорт
	Возврат "Справка плагина";
КонецФункции

// Возвращает имя плагина
//
//  Возвращаемое значение:
//   Строка - имя плагина при подключении
//
Функция Имя() Экспорт
	Возврат "sync-remote";
КонецФункции 

// Возвращает имя лога плагина
//
//  Возвращаемое значение:
//   Строка - имя лога плагина
//
Функция ИмяЛога() Экспорт
	Возврат "oscript.lib.gitsync.plugins.sync-remote";
КонецФункции

#КонецОбласти

#Область Подписки_на_события

Процедура ПриАктивизации(СтандартныйОбработчик) Экспорт

	Обработчик = СтандартныйОбработчик;

	URLРепозитория = "";
	ИмяВетки = "";
	ИмяЦелевойВетки = "";
	ПолучитьИзменения = Ложь;
	ОтправитьИзменения = Ложь;
	ОтправитьЗапросНаСлияние = Ложь;
	ОтправлятьТеги = Ложь;
	PushOptions = "";
	MergeOptions = "";

	КоличествоКоммитовДоPush = 0;
	СчетчикКоммитов = 0;

КонецПроцедуры

Процедура ПриРегистрацииКомандыПриложения(ИмяКоманды, КлассРеализации) Экспорт

	Лог.Отладка("Ищу команду <%1> в списке поддерживаемых", ИмяКоманды);
	Если КомандыПлагина.Найти(ИмяКоманды) = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Лог.Отладка("Устанавливаю дополнительные параметры для команды %1", ИмяКоманды);
	
	КлассРеализации.Опция("PS push", Ложь, "[*sync-remote] Флаг отправки изменений на удаленный репозиторий")
				.Флаг()
				.ВОкружении("GITSYNC_REMOTE_PUSH");
	КлассРеализации.Опция("G pull", Ложь, "[*sync-remote] Флаг получения изменений из удаленный репозитория перед синхронизацией")
				.Флаг()
				.ВОкружении("GITSYNC_REMOTE_PULL");
	КлассРеализации.Опция("MR merge-request", Ложь, "[*sync-remote] Флаг запроса на слияние при отправке изменений на удаленный репозиторий")
				.Флаг()
				.ВОкружении("GITSYNC_REMOTE_MERGE_REQUEST");
	КлассРеализации.Опция("b branch", "master", "[*sync-remote] Имя ветки")
				.ТСтрока()
				.ВОкружении("GITSYNC_REMOTE_BRANCH");
	КлассРеализации.Опция("tb target-branch", "master", "[*sync-remote] Имя целевой ветки для слияния")
				.ТСтрока()
				.ВОкружении("GITSYNC_REMOTE_TARGET_BRANCH");
	КлассРеализации.Опция("T push-tags", Ложь, "[*sync-remote] Флаг отправки тегов по версиям")
				.Флаг()
				.ВОкружении("GITSYNC_REMOTE_PUSH_TAGS");
	КлассРеализации.Опция("n push-n-commits", 0, "[*sync-remote] <число> количество коммитов до промежуточной отправки на удаленный сервер")
				.ТЧисло()
				.ВОкружении("GITSYNC_REMOTE_PUSH_N_COMMITS");
	КлассРеализации.Опция("O push-options", "", "[*sync-remote] Дополнительные параметры для команды push, разделенные ;")
				.ТСтрока()
				.ВОкружении("GITSYNC_PUSH_OPTIONS");
	КлассРеализации.Опция("mo merge-options", "", "[*sync-remote] Дополнительные параметры для команды merge, разделенные ;")
				.ТСтрока()
				.ВОкружении("GITSYNC_MERGE_OPTIONS");
	
	КлассРеализации.Аргумент("URL", "", "[*sync-remote] Адрес удаленного репозитория GIT.")
				.ВОкружении("GITSYNC_REPO_URL")
				.Обязательный(Ложь);

КонецПроцедуры

Процедура ПриПолученииПараметров(ПараметрыКоманды) Экспорт

	URLРепозитория = ПараметрыКоманды.Параметр("URL", "");
	ИмяВетки = ПараметрыКоманды.Параметр("branch", "");
	ИмяЦелевойВетки = ПараметрыКоманды.Параметр("target-branch", "");

	ПолучитьИзменения = ПараметрыКоманды.Параметр("pull", Ложь);
	ОтправитьИзменения = ПараметрыКоманды.Параметр("push", Ложь);
	ОтправитьЗапросНаСлияние = ПараметрыКоманды.Параметр("merge-request", Ложь);
	ОтправлятьТеги = ПараметрыКоманды.Параметр("push-tags", Ложь);
    PushOptions = СтрРазделить(ПараметрыКоманды.Параметр("push-options", ""), ";");
	MergeOptions = СтрРазделить(ПараметрыКоманды.Параметр("merge-options", ""), ";");

	КоличествоКоммитовДоPush = ПараметрыКоманды.Параметр("push-n-commits", 0);

	Лог.Отладка("Установлено получение изменений <%1> ", ПолучитьИзменения);
	Лог.Отладка("Установлено имя ветки <%1> ", ИмяВетки);
	Лог.Отладка("Установлено имя целевой ветки для слияния <%1> ", ИмяЦелевойВетки);
	Лог.Отладка("Установлена отправка изменений <%1> ", ОтправитьИзменения);
	Лог.Отладка("Установлен запрос на слияние <%1> ", ОтправитьЗапросНаСлияние);
	Лог.Отладка("Установлено количество коммитов <%1>, после которых осуществляется отправка", КоличествоКоммитовДоPush);
	Лог.Отладка("Установлен флаг отправки меток в значение <%1> выгрузки версий", ОтправлятьТеги);
    Лог.Отладка("Установлены дополнительные параметры команды push: <%1>", СтрСоединить(PushOptions, ", "));
	Лог.Отладка("Установлены дополнительные параметры команды merge: <%1>", СтрСоединить(MergeOptions, ", "));

КонецПроцедуры

Процедура ПередНачаломВыполнения(ПутьКХранилищу, КаталогРабочейКопии) Экспорт

	Если Не ПолучитьИзменения Тогда
		Возврат;
	КонецЕсли;

	Лог.Информация("Получение изменений с удаленного узла (pull)");

	ГитРепозиторий = ПолучитьГитРепозиторий(КаталогРабочейКопии);
	ГитРепозиторий.ПерейтиВВетку(ИмяВетки);
	ГитРепозиторий.Получить(URLРепозитория, ИмяВетки);

КонецПроцедуры

Процедура ПослеОкончанияВыполнения(ПутьКХранилищу, КаталогРабочейКопии, ТекущаяВерсия) Экспорт

	Если СчетчикКоммитов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ГитРепозиторий = ПолучитьГитРепозиторий(КаталогРабочейКопии);
	ВыполнитьGitPush(ГитРепозиторий, КаталогРабочейКопии);
	ВыполнитьGitMergeRequest(ГитРепозиторий, КаталогРабочейКопии, ТекущаяВерсия);

КонецПроцедуры

Процедура ПослеКоммита(ГитРепозиторий, КаталогРабочейКопии, ТекущаяВерсия) Экспорт

	СчетчикКоммитов = СчетчикКоммитов + 1;

	Если СчетчикКоммитов = КоличествоКоммитовДоPush Тогда

		ВыполнитьGitPush(ГитРепозиторий, КаталогРабочейКопии);
		ВыполнитьGitMergeRequest(ГитРепозиторий, КаталогРабочейКопии, ТекущаяВерсия);
		
		СчетчикКоммитов = 0;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Вспомогательные_процедуры_и_функции

Процедура ВыполнитьGitPush(Знач ГитРепозиторий, Знач ЛокальныйРепозиторий)

	Если Не ОтправитьИзменения Тогда
		Возврат;
	КонецЕсли;

	Лог.Информация("Отправляю изменения на удаленный url (push)");

	ГитРепозиторий.ВыполнитьКоманду(СтрРазделить("gc --auto", " "));
	Лог.Отладка(СтрШаблон("Вывод команды gc: %1", СокрЛП(ГитРепозиторий.ПолучитьВыводКоманды())));

	ПараметрыКомандыPush = Новый Массив;
	ПараметрыКомандыPush.Добавить("push -u");
	ПараметрыКомандыPush.Добавить(СтрЗаменить(URLРепозитория, "%", "%%"));
	ПараметрыКомандыPush.Добавить("-v");
	ПараметрыКомандыPush.Добавить(ИмяВетки);
	
    Для Каждого Опция Из PushOptions Цикл
        Если Не ПустаяСтрока(Опция) Тогда
            ПараметрыКомандыPush.Добавить("-o " + Опция);
        КонецЕсли;
    КонецЦикла;

	//ГитРепозиторий.ПерейтиВВетку(ИмяВетки);
	ГитРепозиторий.ВыполнитьКоманду(ПараметрыКомандыPush);

	Если ОтправлятьТеги Тогда

		ПараметрыКомандыPush = Новый Массив;
		ПараметрыКомандыPush.Добавить("push -u");
		ПараметрыКомандыPush.Добавить(СтрЗаменить(URLРепозитория, "%", "%%"));
		ПараметрыКомандыPush.Добавить("--tags");

		Для Каждого Опция Из PushOptions Цикл
			Если Не ПустаяСтрока(Опция) Тогда
				ПараметрыКомандыPush.Добавить("-o " + Опция);
			КонецЕсли;
		КонецЦикла;

		ГитРепозиторий.ВыполнитьКоманду(ПараметрыКомандыPush);

	КонецЕсли;

	Лог.Отладка(СтрШаблон("Вывод команды Push: %1", СокрЛП(ГитРепозиторий.ПолучитьВыводКоманды())));

КонецПроцедуры

Процедура ВыполнитьGitMergeRequest(Знач ГитРепозиторий, Знач ЛокальныйРепозиторий, Знач ТекущаяВерсия)
	
	Если Не ОтправитьЗапросНаСлияние Тогда
		Возврат;		
	КонецЕсли;

	Лог.Информация("Создаю запрос на слияние в удаленном url (merge request)");

	ГитРепозиторий.ВыполнитьКоманду(СтрРазделить("gc --auto", " "));
	Лог.Отладка(СтрШаблон("Вывод команды gc: %1", СокрЛП(ГитРепозиторий.ПолучитьВыводКоманды())));

	ПараметрыКомандыMerge = Новый Массив;
	ПараметрыКомандыMerge.Добавить("push -u");
	ПараметрыКомандыMerge.Добавить(СтрЗаменить(URLРепозитория, "%", "%%"));
	ПараметрыКомандыMerge.Добавить("-v");
	ПараметрыКомандыMerge.Добавить("HEAD:refs/heads"+ "" +"/VERSION-" + ТекущаяВерсия);

	Для Каждого Опция Из MergeOptions Цикл
        Если Не ПустаяСтрока(Опция) Тогда
            ПараметрыКомандыMerge.Добавить("-o " + Опция);
        КонецЕсли;
    КонецЦикла;
	
	//ГитРепозиторий.ПерейтиВВетку(ИмяЦелевойВетки);
	//ГитРепозиторий.Получить(URLРепозитория, ИмяЦелевойВетки);
	ГитРепозиторий.ВыполнитьКоманду(ПараметрыКомандыMerge);

	Лог.Отладка(СтрШаблон("Вывод команды Merge Request: %1", СокрЛП(ГитРепозиторий.ПолучитьВыводКоманды())));

КонецПроцедуры

Функция ПолучитьГитРепозиторий(Знач КаталогРабочейКопии)
	
	Если Не ГитРепозиторий = Неопределено Тогда
		Возврат ГитРепозиторий;
	КонецЕсли;

	ГитРепозиторий = Новый ГитРепозиторий();
	ГитРепозиторий.УстановитьРабочийКаталог(КаталогРабочейКопии);

	Возврат ГитРепозиторий;

КонецФункции // ПолучитьГитРепозиторий()

Процедура Инициализация()

	Лог = Логирование.ПолучитьЛог(ИмяЛога());
	КомандыПлагина = Новый Массив;
	КомандыПлагина.Добавить("sync");

	URLРепозитория = "";
	ИмяВетки = "";
	ИмяЦелевойВетки = "";
	ПолучитьИзменения = Ложь;
	ОтправитьИзменения = Ложь;
	ОтправитьЗапросНаСлияние = Ложь;
	ОтправлятьТеги = Ложь;

	КоличествоКоммитовДоPush = 0;
	СчетчикКоммитов = 0;

КонецПроцедуры

#КонецОбласти

Инициализация();
